---
kind: method
id: M:Autodesk.Revit.DB.BeamSystem.DropBeamSystem(Autodesk.Revit.DB.BeamSystem)
source: html/c1c29f1c-bcc2-947c-8cf6-380e0b5d64be.htm
---
# Autodesk.Revit.DB.BeamSystem.DropBeamSystem Method

Drop beam system, it will disassociate all members from the beam system and delete the beam system.

## Syntax (C#)
```csharp
public static void DropBeamSystem(
	BeamSystem beamSystem
)
```

## Parameters
- **beamSystem** (`Autodesk.Revit.DB.BeamSystem`) - The beam system to be deleted.